IDEA Open Model
CrossSectionFactory.FillShapeDblLu Method
Compatible with IDEA StatiCa Beta 20.0
 Creates a new L shape css.
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillShapeDblLu(
	CrossSectionParameter css,
	double h,
	double b,
	double th,
	double sh,
	double dis
)
Public Shared Sub FillShapeDblLu (
	css As CrossSectionParameter,
	h As Double,
	b As Double,
	th As Double,
	sh As Double,
	dis As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
h
Type: System.Double
The height of css.
b
Type: System.Double
The width of css.
th
Type: System.Double
The bottom flange thisckness.
sh
Type: System.Double
The wall thickness.
dis
Type: System.Double
Distance between _||_
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace